tap "homebrew/bundle"
# Download with resuming and segmented downloading
brew "aria2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat", args: ["HEAD"]
# New way to see and navigate directory trees
brew "broot"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop", args: ["HEAD"]
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Object-file caching compiler wrapper
brew "ccache", args: ["HEAD"]
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared", args: ["HEAD"]
# Wrapper around make to colorize the output
brew "colormake", args: ["HEAD"]
# Defines a standard way of committing rules and communicating it
brew "commitizen", args: ["HEAD"]
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Pack, ship and run any application as a lightweight container
brew "docker", args: ["HEAD"]
# Isolated development environments using Docker
brew "docker-compose", args: ["HEAD"]
# More intuitive version of du in rust
brew "dust", args: ["HEAD"]
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch", args: ["HEAD"]
# Simple, fast and user-friendly alternative to find
brew "fd", args: ["HEAD"]
# Command-line fuzzy finder written in Go
brew "fzf", args: ["HEAD"]
# GitHub command-line tool
brew "gh", args: ["HEAD"]
# Distributed revision control system
brew "git", args: ["HEAD"]
# Syntax-highlighting pager for git and diff output
brew "git-delta", args: ["HEAD"]
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit", args: ["HEAD"]
# Linux virtual machines
brew "lima", args: ["HEAD"]
# Mac App Store command-line interface
brew "mas", args: ["HEAD"]
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Improved Nano Syntax Highlighting Files
brew "nanorc", args: ["HEAD"]
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc", args: ["HEAD"]
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Modern shell for the GitHub era
brew "nushell", args: ["HEAD"]
# Command-line Git information tool
brew "onefetch", args: ["HEAD"]
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit", args: ["HEAD"]
# Interpreted, interactive, object-oriented programming language
brew "python-freethreading"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Python interface to Tcl/Tk
brew "python-tk@3.12"
# Python interface to Tcl/Tk
brew "python-tk@3.13"
# Search tool like grep and The Silver Searcher
brew "ripgrep", args: ["HEAD"]
# Extremely fast tool to remove dupes and other lint from your filesystem
brew "rmlint"
# Extremely fast Python linter, written in Rust
brew "ruff", args: ["HEAD"]
# Rust toolchain installer
brew "rustup", args: ["HEAD"]
# Experimental Package Management Solution for Python
brew "rye"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip", args: ["HEAD"]
# Cross-shell prompt for astronauts
brew "starship", args: ["HEAD"]
# Very fast implementation of tldr in Rust
brew "tealdeer", args: ["HEAD"]
# Extremely fast Python package installer and resolver, written in Rust
brew "uv", args: ["HEAD"]
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# JavaScript toolchain manager for reproducible environments
brew "volta", args: ["HEAD"]
# Best command-line tool to install and switch between multiple versions of Xcode
brew "xcodes"
# Check your $HOME for unwanted files and directories
brew "xdg-ninja", args: ["HEAD"]
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij", args: ["HEAD"]
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Next-generation plugin manager for zsh
brew "zplug", args: ["HEAD"]
# GPU-accelerated terminal emulator
cask "alacritty"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Android SDK component
cask "android-platform-tools"
# Local-first and end-to-end encrypted notes app
cask "anytype@beta"
# Chromium based browser
cask "arc"
# Software for drawing and painting
cask "clip-studio-paint"
cask "font-jf-open-huninn"
cask "font-meslo-lg-nerd-font"
cask "font-noto-color-emoji"
cask "font-noto-sans-mono-cjk-jp"
cask "font-noto-sans-mono-cjk-tc"
# Remote development gateway by Jetbrains
cask "jetbrains-gateway"
# Find shortcuts for any installed application
cask "keyclu"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your tools with a few keystrokes
cask "raycast"
# Resources for Wacom tablets
cask "wacom-tablet"
# Lossless audio decoder
cask "xld"
# Multiplayer code editor
cask "zed@preview"
mas "AdGuard for Safari", id: 1440147259
mas "Keynote", id: 409183694
mas "Lightweight PDF", id: 1450640351
mas "LINE", id: 539883307
mas "Microsoft PowerPoint", id: 462062816
mas "Numbers", id: 409203825
mas "Orbot", id: 1609461599
mas "Pages", id: 409201541
mas "Raycast Companion", id: 6738274497
mas "Save to Pocket", id: 1477385213
mas "Save to Raindrop.io", id: 1549370672
mas "Surfshark", id: 1437809329
mas "TestFlight", id: 899247664
mas "Todoist", id: 585829637
